{
  "base_model_name_or_path": "",
  "bias": "none",
  "fan_in_fan_out": false,
  "lora_alpha": 32.0,
  "lora_dropout": 0.0,
  "peft_type": "LORA",
  "r": 16,
  "target_modules": [
    "q_proj",
    "k_proj",
    "v_proj",
    "o_proj"
  ],
  "task_type": "CAUSAL_LM",
  "use_rslora": false
}